import {createEvent, createStore} from "effector";

export const setKanaData2 = createEvent()
const reset = createEvent()
export const setIsHiragana2 = createEvent()
const reset2 = createEvent()
export const setIsNigory2 = createEvent()
const reset3 = createEvent()
export const setIsHannagory2 = createEvent()
const reset4 = createEvent()
export const setIsIndex2 = createEvent()
const reset5 = createEvent()

export const kanaData2 = createStore({
  hiragana: [['あ', 'а', 0], ['い', 'и', 0], ['う', 'у', 0], ['え', 'э', 0], ['お', 'о', 0], ['か', 'ка', 0], ['き', 'ки', 0],
    ['く', 'ку', 0], ['け', 'кэ', 0], ['こ', 'ко', 0], ['さ', 'са', 0], ['し', 'си', 0], ['す', 'су', 0], ['せ', 'сэ', 0], ['そ', 'со', 0],
    ['た', 'та', 0], ['ち', 'ти', 0], ['つ', 'цу', 0], ['て', 'тэ', 0], ['と', 'то', 0], ['な', 'на', 0], ['に', 'ни', 0], ['ぬ', 'ну', 0],
    ['ね', 'нэ', 0], ['の', 'но', 0], ['は', 'ха', 0], ['ひ', 'хи', 0], ['ふ', 'фу', 0], ['へ', 'хэ', 0], ['ほ', 'хо', 0], ['ま', 'ма', 0],
    ['み', 'ми', 0], ['む', 'му', 0], ['め', 'мэ', 0], ['も', 'мо', 0], ['や', 'я', 0], ['ゆ', 'ю', 0], ['よ', 'ё', 0], [' ', ' ', 0],
    [' ', ' ', 0], ['ら', 'ра', 0], ['り', 'ри', 0], ['る', 'ру', 0], ['れ', 'рэ', 0], ['ろ', 'ро', 0], ['わ', 'ва', 0], [' ', ' ', 0],
    ['を', 'во', 0], [' ', ' ', 0], ['ん', 'н', 0]],
  katakana: [['ア', 'а', 0], [' イ', 'и', 0], ['ウ', 'у', 0], ['エ', 'э', 0], ['オ', 'о', 0], ['カ', 'ка', 0], ['キ', 'ки', 0],
    ['ク', 'ку', 0], ['ケ', 'кэ', 0], ['コ', 'ко', 0], ['サ', 'са', 0], ['シ', 'си', 0], ['ス', 'су', 0], ['セ', 'сэ', 0], ['ソ', 'со', 0],
    ['タ', 'та', 0], ['チ', 'ти', 0], ['ツ', 'цу', 0], ['テ', 'тэ', 0], ['ト', 'то', 0], ['ナ', 'на', 0], ['ニ', 'ни', 0], ['ヌ', 'ну', 0],
    ['ネ', 'нэ', 0], ['ノ', 'но', 0], ['ハ', 'ха', 0], ['ヒ', 'хи', 0], ['フ', 'фу', 0], ['ヘ', 'хэ', 0], ['ホ', 'хо', 0], ['マ', 'ма', 0],
    ['ミ', 'ми', 0], ['ム', 'му', 0], ['メ', 'мэ', 0], ['モ', 'мо', 0], ['ヤ', 'я', 0], ['ユ', 'ю', 0], ['ヨ', 'ё', 0], [' ', ' ', 0],
    [' ', ' ', 0], ['ラ', 'ра', 0], ['リ', 'ри', 0], ['ル', 'ру', 0], ['レ', 'рэ', 0], ['ロ', 'ро', 0], ['ワ', 'ва', 0], [' ', ' ', 0],
    ['ヲ', 'во', 0], [' ', ' ', 0], ['ン', 'н', 0]],
  hiraganaNigori: [['が', 'га', 0], ['ぎ', 'ги', 0], ['ぐ', 'гу', 0], ['げ', 'гэ', 0], ['ご', 'го', 0], ['ざ', 'дза', 0], ['じ', 'дзи', 0],
    ['ず', 'дзу', 0], ['ぜ', 'дзэ', 0], ['ぞ', 'дзо', 0], ['だ', 'да', 0], ['ぢ', 'дзи', 0], ['づ', 'дзу', 0], ['で', 'дэ', 0], ['ど', 'до', 0],
    ['ば', 'ба', 0], ['び', 'би', 0], ['ぶ', 'бу', 0], ['べ', 'бэ', 0], ['ぼ', 'бо', 0]],
  katakanaNigori: [['ガ', 'га', 0], ['ギ', 'ги', 0], ['グ', 'гу', 0], ['ゲ', 'гэ', 0], ['ゴ', 'го', 0], ['ザ', 'дза', 0], ['ジ', 'дзи', 0],
    ['ズ', 'дзу', 0], ['ゼ', 'дзэ', 0], ['ゾ', 'дзо', 0], ['ダ', 'да', 0], ['ヂ', 'дзи', 0], ['ヅ', 'дзу', 0], ['デ', 'дэ', 0], ['ド', 'до', 0],
    ['バ', 'ба', 0], ['ビ', 'би', 0], ['ブ', 'бу', 0], ['ベ', 'бэ', 0], ['ボ', 'бо', 0]],
  hiraganaHannogiri: [['ぱ', 'па', 0], ['ぴ', 'пи', 0], ['ぷ', 'пу', 0], ['ぺ', 'пэ', 0], ['ぽ', 'по', 0]],
  katakanaHannogiri: [['パ', 'па', 0], ['ピ', 'пи', 0], ['プ', 'пу', 0], ['ペ', 'пэ', 0], ['ポ', 'по', 0]],
})
  .on(setKanaData2, (state, value) => value)
  .reset(reset)

export const isHiragana2 = createStore(true)
  .on(setIsHiragana2, (state, value) => value)
  .reset(reset2)

export const isNigory2 = createStore(true)
  .on(setIsNigory2, (state, value) => value)
  .reset(reset3)

export const isHannagory2 = createStore(true)
  .on(setIsHannagory2, (state, value) => value)
  .reset(reset4)

export const isIndex2 = createStore(0)
  .on(setIsIndex2, (state, value) => value)
  .reset(reset5)
